# My Essential Tools to work with Data

In [57]:
# Columns and Row interations (add, delete, move)
# Change values and types
# Build columns with interations each other
# Overview calculation (subtotal, average, delta)
# Look up into external dataset to find correspondent values
# Pivot tables
# Plot many different charts

In [58]:
# include main libraries
import numpy as np
import pandas as pd

In [75]:
cols1 = ['product', 'cost', 'categorie']
cols2 = ['product', 'steel', 'copper', 'imported', 'not_found']

data1 = [['A',100, 'sheet metal'],
         ['B',450, 'busbar'],
         ['C',11, 'miscellaneous']]

data2 = [['A',20,0,0,None],
         ['B',0,22,0,None],
         ['C',0,0,0.33,None],
        ['C',0,0,0.33,None]]

df1 = pd.DataFrame(data1, columns=cols1)
df2 = pd.DataFrame(data2, columns=cols2)

In [76]:
df1

  product  cost      categorie
0       A   100    sheet metal
1       B   450         busbar
2       C    11  miscellaneous

In [77]:
df2

  product  steel  copper  imported not_found
0       A     20       0      0.00      None
1       B      0      22      0.00      None
2       C      0       0      0.33      None
3       C      0       0      0.33      None

In [78]:
# Columns and Row interations (add, delete, move)
# add new column into df1

df1['share'] = (df['cost']/df['cost'].sum())*100
df1

  product  cost      categorie      share
0       A   100    sheet metal  17.825312
1       B   450         busbar  80.213904
2       C    11  miscellaneous   1.960784

In [79]:
# add delete column 'not_found' from df2
df2 = df2.drop('not_found', axis=1)

In [80]:
# remove duplicated values into df2
df2.drop_duplicates()

  product  steel  copper  imported
0       A     20       0      0.00
1       B      0      22      0.00
2       C      0       0      0.33

In [101]:
# switch columns position on df1
df1 = df1[['product', 'categorie', 'cost', 'share']]
df1

  product      categorie   cost      share
0       A    sheet metal  100.0  17.825312
1       B         busbar  450.0  80.213904
2       C  miscellaneous   11.0   1.960784

In [108]:
# Change values and types
df1['cost'] = df1['cost'].astype('float')
df1.dtypes

product       object
categorie     object
cost         float64
share        float64
dtype: object